Revit 2024 API
FabricationPart.CutType Property
 The cut type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int CutType { get; }
Visual Basic
Public ReadOnly Property CutType As Integer
	Get
Visual C++
public:
property int CutType {
	int get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace